name: "Can_Fea_Learn"

##############
### data layer
##############

layer {
  name: "fea_data"
  type: "FrameROIData"
  top: "videofea_data"
  top: "video_info"
  top: "gt_boxes"
  include {
    phase: TRAIN
  }
  data_param {
    source: "./Data/anet_can_train_lmdb"
    batch_size: 1
    backend: LMDB
  }
}

layer {
  name: "fea_data"
  type: "FrameROIData"
  top: "videofea_data"
  top: "video_info"
  top: "gt_boxes"
  include {
    phase: TEST
  }
  data_param {
    source: "./Data/anet_can_val_lmdb"
    batch_size: 1
    backend: LMDB
  }
}

################################ Base Layers BEGIN ################################
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "videofea_data"
  top: "conv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 2048
	kernel_size: 3
	stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "conv1_relu"  
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}


layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 1024
	kernel_size: 3
	stride: 1
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "conv2_relu"  
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_h: 3
	kernel_w: 1
	stride: 2
  }
}
################################ Base Layers END ################################

################################ Anchor Layers BEGIN ################################
layer {
  name: "conv_a1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv_a1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a1_relu"  
  type: "ReLU"
  bottom: "conv_a1"
  top: "conv_a1"
}

layer {
  name: "conv_a2"
  type: "Convolution"
  bottom: "conv_a1"
  top: "conv_a2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a2_relu"  
  type: "ReLU"
  bottom: "conv_a2"
  top: "conv_a2"
}

layer {
  name: "conv_a3"
  type: "Convolution"
  bottom: "conv_a2"
  top: "conv_a3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a3_relu"  
  type: "ReLU"
  bottom: "conv_a3"
  top: "conv_a3"
}

layer {
  name: "conv_a4"
  type: "Convolution"
  bottom: "conv_a3"
  top: "conv_a4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a4_relu"  
  type: "ReLU"
  bottom: "conv_a4"
  top: "conv_a4"
}

layer {
  name: "conv_a5"
  type: "Convolution"
  bottom: "conv_a4"
  top: "conv_a5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a5_relu"  
  type: "ReLU"
  bottom: "conv_a5"
  top: "conv_a5"
}

layer {
  name: "conv_a6"
  type: "Convolution"
  bottom: "conv_a5"
  top: "conv_a6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a6_relu"  
  type: "ReLU"
  bottom: "conv_a6"
  top: "conv_a6"
}

layer {
  name: "conv_a7"
  type: "Convolution"
  bottom: "conv_a6"
  top: "conv_a7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a7_relu"  
  type: "ReLU"
  bottom: "conv_a7"
  top: "conv_a7"
}

layer {
  name: "conv_a8"
  type: "Convolution"
  bottom: "conv_a7"
  top: "conv_a8"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a8_relu"  
  type: "ReLU"
  bottom: "conv_a8"
  top: "conv_a8"
}
layer {
  name: "conv_a9"
  type: "Convolution"
  bottom: "conv_a8"
  top: "conv_a9"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
	kernel_size: 3
	stride: 2
    pad: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv_a9_relu"  
  type: "ReLU"
  bottom: "conv_a9"
  top: "conv_a9"
}
################################ Anchor Layers END ################################
layer {
  name: "rpn_cls_score_1"
  type: "Convolution"
  bottom: "conv_a1"
  top: "rpn_cls_score_1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9   # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_1"
  type: "Convolution"
  bottom: "conv_a1"
  top: "rpn_bbox_pred_1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "rpn_cls_score_2"
  type: "Convolution"
  bottom: "conv_a2"
  top: "rpn_cls_score_2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9   # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_2"
  type: "Convolution"
  bottom: "conv_a2"
  top: "rpn_bbox_pred_2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "rpn_cls_score_3"
  type: "Convolution"
  bottom: "conv_a3"
  top: "rpn_cls_score_3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9   # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_3"
  type: "Convolution"
  bottom: "conv_a3"
  top: "rpn_bbox_pred_3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "rpn_cls_score_4"
  type: "Convolution"
  bottom: "conv_a4"
  top: "rpn_cls_score_4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9   # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_4"
  type: "Convolution"
  bottom: "conv_a4"
  top: "rpn_bbox_pred_4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "rpn_cls_score_5"
  type: "Convolution"
  bottom: "conv_a5"
  top: "rpn_cls_score_5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9   # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_5"
  type: "Convolution"
  bottom: "conv_a5"
  top: "rpn_bbox_pred_5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "rpn_cls_score_6"
  type: "Convolution"
  bottom: "conv_a6"
  top: "rpn_cls_score_6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9   # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_6"
  type: "Convolution"
  bottom: "conv_a6"
  top: "rpn_bbox_pred_6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "rpn_cls_score_7"
  type: "Convolution"
  bottom: "conv_a7"
  top: "rpn_cls_score_7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9   # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_7"
  type: "Convolution"
  bottom: "conv_a7"
  top: "rpn_bbox_pred_7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "rpn_cls_score_8"
  type: "Convolution"
  bottom: "conv_a8"
  top: "rpn_cls_score_8"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9  # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_8"
  type: "Convolution"
  bottom: "conv_a8"
  top: "rpn_bbox_pred_8"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "rpn_cls_score_9"
  type: "Convolution"
  bottom: "conv_a9"
  top: "rpn_cls_score_9"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 9  # 2(bg/fg) * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred_9"
  type: "Convolution"
  bottom: "conv_a9"
  top: "rpn_bbox_pred_9"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 6   # 2 * 4(anchors)
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0 }
  }
}


layer {
   name: "rpn_cls_score_reshape_1"
   type: "Reshape"
   bottom: "rpn_cls_score_1"
   top: "rpn_cls_score_reshape_1"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}
layer {
   name: "rpn_cls_score_reshape_2"
   type: "Reshape"
   bottom: "rpn_cls_score_2"
   top: "rpn_cls_score_reshape_2"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}
layer {
   name: "rpn_cls_score_reshape_3"
   type: "Reshape"
   bottom: "rpn_cls_score_3"
   top: "rpn_cls_score_reshape_3"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}
layer {
   name: "rpn_cls_score_reshape_4"
   type: "Reshape"
   bottom: "rpn_cls_score_4"
   top: "rpn_cls_score_reshape_4"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}
layer {
   name: "rpn_cls_score_reshape_5"
   type: "Reshape"
   bottom: "rpn_cls_score_5"
   top: "rpn_cls_score_reshape_5"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}
layer {
   name: "rpn_cls_score_reshape_6"
   type: "Reshape"
   bottom: "rpn_cls_score_6"
   top: "rpn_cls_score_reshape_6"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}
layer {
   name: "rpn_cls_score_reshape_7"
   type: "Reshape"
   bottom: "rpn_cls_score_7"
   top: "rpn_cls_score_reshape_7"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}
layer {
   name: "rpn_cls_score_reshape_8"
   type: "Reshape"
   bottom: "rpn_cls_score_8"
   top: "rpn_cls_score_reshape_8"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}
layer {
   name: "rpn_cls_score_reshape_9"
   type: "Reshape"
   bottom: "rpn_cls_score_9"
   top: "rpn_cls_score_reshape_9"
   reshape_param { shape { dim: 0 dim: 3 dim: -1 } }
}

layer {
  name: "rpn_cls_score_concat"
  type: "Concat"
  bottom: "rpn_cls_score_reshape_1"
  bottom: "rpn_cls_score_reshape_2"
  bottom: "rpn_cls_score_reshape_3"
  bottom: "rpn_cls_score_reshape_4"
  bottom: "rpn_cls_score_reshape_5"
  bottom: "rpn_cls_score_reshape_6"
  bottom: "rpn_cls_score_reshape_7"
  bottom: "rpn_cls_score_reshape_8"
  bottom: "rpn_cls_score_reshape_9"
  top: "rpn_cls_score_concat"
  concat_param {
    axis: 2
  }
}

layer {
   name: "rpn_bbox_pred_reshape_1"
   type: "Reshape"
   bottom: "rpn_bbox_pred_1"
   top: "rpn_bbox_pred_reshape_1"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}
layer {
   name: "rpn_bbox_pred_reshape_2"
   type: "Reshape"
   bottom: "rpn_bbox_pred_2"
   top: "rpn_bbox_pred_reshape_2"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}
layer {
   name: "rpn_bbox_pred_reshape_3"
   type: "Reshape"
   bottom: "rpn_bbox_pred_3"
   top: "rpn_bbox_pred_reshape_3"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}
layer {
   name: "rpn_bbox_pred_reshape_4"
   type: "Reshape"
   bottom: "rpn_bbox_pred_4"
   top: "rpn_bbox_pred_reshape_4"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}
layer {
   name: "rpn_bbox_pred_reshape_5"
   type: "Reshape"
   bottom: "rpn_bbox_pred_5"
   top: "rpn_bbox_pred_reshape_5"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}
layer {
   name: "rpn_bbox_pred_reshape_6"
   type: "Reshape"
   bottom: "rpn_bbox_pred_6"
   top: "rpn_bbox_pred_reshape_6"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}
layer {
   name: "rpn_bbox_pred_reshape_7"
   type: "Reshape"
   bottom: "rpn_bbox_pred_7"
   top: "rpn_bbox_pred_reshape_7"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}
layer {
   name: "rpn_bbox_pred_reshape_8"
   type: "Reshape"
   bottom: "rpn_bbox_pred_8"
   top: "rpn_bbox_pred_reshape_8"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}
layer {
   name: "rpn_bbox_pred_reshape_9"
   type: "Reshape"
   bottom: "rpn_bbox_pred_9"
   top: "rpn_bbox_pred_reshape_9"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 } }
}

layer {
  name: "rpn_bbox_pred_concat"
  type: "Concat"
  bottom: "rpn_bbox_pred_reshape_1"
  bottom: "rpn_bbox_pred_reshape_2"
  bottom: "rpn_bbox_pred_reshape_3"
  bottom: "rpn_bbox_pred_reshape_4"
  bottom: "rpn_bbox_pred_reshape_5"
  bottom: "rpn_bbox_pred_reshape_6"
  bottom: "rpn_bbox_pred_reshape_7"
  bottom: "rpn_bbox_pred_reshape_8"
  bottom: "rpn_bbox_pred_reshape_9"
  top: "rpn_bbox_pred_concat"
  concat_param {
    axis: 2
  }
}

layer {
  name: "anchor_seq_1"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_1"
  bottom: "video_info"
  top: "anchor_seq_1"
  anchor_target_param {
    scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 4
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_2"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_2"
  bottom: "video_info"
  top: "anchor_seq_2"
  anchor_target_param {
	scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 8
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_3"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_3"
  bottom: "video_info"
  top: "anchor_seq_3"
  anchor_target_param {
	scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 16
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_4"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_4"
  bottom: "video_info"
  top: "anchor_seq_4"
  anchor_target_param {
	scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 32
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_5"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_5"
  bottom: "video_info"
  top: "anchor_seq_5"
  anchor_target_param {
    scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 64
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_6"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_6"
  bottom: "video_info"
  top: "anchor_seq_6"
  anchor_target_param {
    scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 128
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_7"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_7"
  bottom: "video_info"
  top: "anchor_seq_7"
  anchor_target_param {
    scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 256
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_8"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_8"
  bottom: "video_info"
  top: "anchor_seq_8"
  anchor_target_param {
    scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 512
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_9"
  type: "AnchorSeq"
  bottom: "rpn_bbox_pred_reshape_9"
  bottom: "video_info"
  top: "anchor_seq_9"
  anchor_target_param {
    scale_ratios: 1
	scale_ratios: 1.25
	scale_ratios: 1.5
	feat_stride: 1024
	#use_clip_blob1: true
  }
}
layer {
  name: "anchor_seq_concat"
  type: "Concat"
  bottom: "anchor_seq_1"
  bottom: "anchor_seq_2"
  bottom: "anchor_seq_3"
  bottom: "anchor_seq_4"
  bottom: "anchor_seq_5"
  bottom: "anchor_seq_6"
  bottom: "anchor_seq_7"
  bottom: "anchor_seq_8"
  bottom: "anchor_seq_9"
  top: "anchor_seq_concat"
  concat_param {
    axis: 2
  }
}

layer {
  name: "rpn_cls_score_slice"
  type: "Slice"
  bottom: "rpn_cls_score_concat"
  top: "rpn_cls_score_conf"
  top: "rpn_cls_score_overlap"
  slice_param {
    axis: 1
    slice_point: 2
  }
}

layer {
   name: "rpn_data"
   type: "AnchorTargetSeq"
   bottom: "rpn_cls_score_conf"
   bottom: "gt_boxes"
   bottom: "video_info"
   bottom: "anchor_seq_concat"
   top: "rpn_labels"
   top: "rpn_bbox_targets"
   top: "rpn_bbox_inside_weights"
   top: "rpn_bbox_outside_weights"
   top: "rpn_overlap"
   frcnn_param {
     rpn_bbox_inside_weights: "1.0, 1.0"
	 rpn_positive_overlap: 0.8
	 rpn_min_size: 2
   }
   anchor_target_param {
     neg_ratio: 1
   }
}

layer {
  name: "rpn_cls_score_sigmoid"
  type: "Sigmoid"
  bottom: "rpn_cls_score_overlap"
  top: "rpn_cls_score_sigmoid"
}

layer {
  name: "l2_loss"
  type: "EuclideanIGLoss"
  bottom: "rpn_cls_score_sigmoid"
  bottom: "rpn_overlap"
  top: "l2_loss"
  loss_weight: 50
  propagate_down: 1
  propagate_down: 0
}

layer {
  name: "rpn_loss_cls"
  type: "SoftmaxWithLoss"
  bottom: "rpn_cls_score_conf"
  bottom: "rpn_labels"
  propagate_down: 1
  propagate_down: 0
  top: "rpn_cls_loss"
  loss_weight: 2
  loss_param {
    ignore_label: -1
    normalize: true
  }
}

layer {
  name: "rpn_loss_bbox"
  type: "SmoothL1FrcnLoss"
  bottom: "rpn_bbox_pred_concat"
  bottom: "rpn_bbox_targets"
  bottom: "rpn_bbox_inside_weights"
  bottom: "rpn_bbox_outside_weights"
  top: "rpn_loss_bbox"
  loss_weight: 1
  smooth_l1_loss_param { sigma: 3.0 }
}
